# Дано открытое число x. Является ли оно предложением или отрицательным.
# Формат входных данных: дано одно открытое число. Гарантируется, что число ≠ 0.
# Формат выходных данных: Требуется тип выходного текста

number = float(input())  # Считываемся открытым числом

if number > 0:
    print("Положительное")
else:
    print("Отрицательное")
    
    
